"""
Name: jirayut Jeebjong
Id: 364411760011
Group: MIT421
"""

วิธีการรับประทานยาพาราเซตามอล
อายุุ 10-15 ทานยาครั้งละ 1 เม็ด 10 <= age <= 15
อายุ 16-20 ทานยาครั้งละ 1.5 เม็ด , age >= 1 and age <= 9
อายุ 20 ปีขึ้นไป ทานยาครั้งละ 2 เม็ด
"""
# if-else-if

# ถ้าอายุน้อยกว่า 20 คือ เด็ก ถ้ามากกว่าหรือเท่ากับ 20 คือผู้ใหญ่

print("ระบบแนะนำการรับประทานยาพาราเซตามอล\n")
age = float(input("คุณอายุเท่าไร? : "))

if age <10:
    print("ห้าทรับประทาน")
elif age >= 10 and age <= 15:
    print("รับประทานครั้งละ 1 เม็ด.")
elif age >= 16 and age <= 20:
    print("รับประทานครั้งละ 1.5 เม็ด")
else:
    print("รับประทานครั้งละ 2 เม็ด.")

print("ขอบคุณครับ/คะ")