"""
Name: Jirayut Jeebjong
ID: 364411760011
Group: MIT421
"""

"""
# Question 3
เขียนโปรแกรมรับค่าอินพุต 2 ตัว ที่เป็นจำนวนเต็ม (width,length) และตรวจสอบว่า  ถ้าอินพุตตัวใดตัวหนึ่ง
หรือทั้งสองตัวเป็น 0 หรือจำนวนเต็มลบให้พิมพ์ "กรุณากรอกจำนวนเต็มบวก" แต่ถ้าเป็นจำนวนเต็มบวกทั้งคู่ให้คำนวณพื้นที่
สี่เหลี่ยมและพิมพ์ค่าพื้นที่สี่เหลี่ยมออกทางหน้าจอภาพ
"""
a = int(input("enter your width: "))
b = int(input("enter your length: "))
if (a <= 0) :
    print("กรุณากรอกจำนวนเต็มบวก")
else:
    print("a * b = %d" % (a * b))

