"""
Name: {}
SID: {}
Group: {}
"""
"""
# Question 6
คุณเป็นโปรแกรมเมอร์ในธนาคารแห่งหนึ่ง ลูกค้าของธนาคารแห่งนี้ส่วนใหญ่แล้วเป็นคนอเมริกันและคนญี่ปุ่น 
โดยปกติลูกค้าจะมาใช้บริกาารแลกเงินบาท คุณได้รับหน้าที่ให้เขียนโปรแกรมซึ่งมีรายละเอียดดังนี้
    - รับอินพุต 2 ตัวที่เป็นสายอักขระ และจำนวนจริง (currency, amount) เพื่อคำนวณจำนวนเงินที่ลูกค้าแลกได้และพิมพ์ออกมา โดยมีเงื่อนไขดังนี้
        - ถ้า currency เท่ากับ USD จำนวนเงินในหน่วยบาที่แลกได้ดังนี้ THB = USD x 36.5
        - ถ้า currency เท่ากับ JPY จำนวนเงินในหน่วยบาที่แลกได้ดังนี้ THB = USD x 0.17

---- ตัวอย่างการแสดงผล ----

#### MT Exchange Currency Bank ####
กรุณาเลือกสกุลเงินที่ท่านมี
    1. USD
    2. JPY
เลือก ?: 1
กรุณาระบุจำนวนเงิน: 500

จำนวนเงิน 500 USD สามารถแลกเป็นเงินไทยบาท (THB) ได้เท่ากับ 18,250 บาท


"""