"""
Name: Jirayut Jeebjong
ID: 364411760011
Group: MIT421
"""

"""
# Question 5
เขียนโปรแกรมคำนวนผลการเรียนโดยรับค่าอินพุตคะแนน 1 ตัวที่เป็นจำนวนจริง จากนั้นตรวจสอบค่าคะแนนดังต่อไปนี้
    •	ถ้าคะแนนมอยู่ระหว่าง 80.00-100.0 ให้พิมพ์ A
    •	ถ้าคะแนนอยู่ระหว่าง 75.0 - 79.99 ให้พิมพ์ B+
    •	ถ้าคะแนนอยู่ระหว่าง 70.0 - 74.99 ให้พิมพ์ B
    •	ถ้าคะแนนอยู่ระหว่าง 65.0 - 69.99 ให้พิมพ์ C+
    •	ถ้าคะแนนอยู่ระหว่าง 60.0 - 64.99 ให้พิมพ์ C
    •	ถ้าคะแนนอยู่ระหว่าง 55.0 - 59.99 ให้พิมพ์ D+
    •	ถ้าคะแนนอยู่ระหว่าง 50.0 - 54.99 ให้พิมพ์ D
    •	ถ้าคะแนนน้อยกว่า 49.99 ให้พิมพ์ F
"""

grad = int(input("enter your grad: "))
if (grad >= 80) :
    print("A")
elif (grad >= 75) :
    print("B+")
elif (grad >= 70) :
    print("B")
elif (grad >= 65) :
    print("C+")
elif (grad >= 60) :
    print("C")
elif (grad >= 55) :
    print("D+")
elif (grad >= 50) :
    print("D")
else :
    print("F")